Repository: otaku0304/Internationalization
Catalog: src/translate/messages.*.xlf
Languages: nl, sr

# welcomeMessage
source: Welcome to my i18n demonstration page! Here, we're showcasing the power of internationalization (i18n) – a crucial aspect of modern applications that enables them to adapt and cater to diverse audiences around the world.
nl: Welkom bij mijn i18n-demonstratiepagina! Hier laten we de kracht van internationalisatie (i18n) zien - een cruciaal aspect van moderne applicaties dat ze in staat stelt zich aan te passen en te voorzien in diverse doelgroepen over de hele wereld.
sr: Dobrodošli na našu stranicu za demonstraciju i18n! Ovde prikazujemo moć internacionalizacije (i18n) - ključnog aspekta modernih aplikacija koji im omogućava da se prilagode i zadovolje raznoliku publiku širom sveta.

# navigateMessage
source: As you navigate through this page, you'll notice that the content seamlessly transforms to match different languages and locales. This means that whether you're reading this in English, Spanish, French, or any other language, the message remains clear and accessible.
nl: Terwijl je door deze pagina navigeert, zul je merken dat de inhoud naadloos verandert om overeen te komen met verschillende talen en regio's. Dit betekent dat of je dit nu leest in het Engels, Spaans, Frans of een andere taal, de boodschap duidelijk en toegankelijk blijft.
sr: Kako navigirate kroz ovu stranicu, primetićete da se sadržaj bez problema transformiše kako bi se prilagodio različitim jezicima i lokalizacijama. Ovo znači da bez obzira da li čitate na engleskom, španskom, francuskom ili nekom drugom jeziku, poruka ostaje jasna i dostupna.

# beyondTranslationMessage
source: i18n goes beyond just translating words; it encompasses date formats, currencies, and even cultural nuances, ensuring that users feel at home no matter where they're from.
nl: i18n gaat verder dan alleen woorden vertalen; het omvat datums, valuta en zelfs culturele nuances, waardoor gebruikers zich thuis voelen, ongeacht waar ze vandaan komen.
sr: i18n prevazilazi puko prevođenje reči; obuhvata formate datuma, valute, pa čak i kulturne nijanse, osiguravajući da se korisnici osećaju kao kod kuće bez obzira odakle dolaze.

# languageSelectorMessage
source: Feel free to switch between languages using the language selector at the top of the page. Watch as the content instantly adapts, showcasing the magic of i18n.
nl: Voel je vrij om tussen talen te schakelen met behulp van de taalselector bovenaan de pagina. Kijk hoe de inhoud direct aanpast en de magie van i18n laat zien.
sr: Slobodno menjajte jezike koristeći selektor jezika na vrhu stranice. Posmatrajte kako se sadržaj trenutno prilagođava, prikazujući magiju i18n.

# thankYouMessage
source: Thank you for being a part of this journey into the world of i18n. Your seamless experience across languages starts right here, right now.
nl: Dank je wel dat je deel uitmaakt van deze reis in de wereld van i18n. Jouw naadloze ervaring over talen heen begint hier, nu.
sr: Hvala vam što ste deo ove avanture u svet i18n. Vaše besprekorno iskustvo preko jezika počinje baš ovde, baš sada.

# authorHeading
source: Author
nl: Auteur
sr: Аутор

# aboutMeHeading
source: About Me
nl: Over mij
sr: О мени

# aboutMeContent
source: Hello there! I'm Sai Krishna Annam, a passionate Full Stack developer who thrives on bringing ideas to life through code. With a knack for problem-solving and a love for crafting seamless digital experiences, I'm always on the lookout for the next exciting challenge in the world of web development.
nl: Hallo daar! Ik ben Sai Krishna Annam, een gepassioneerde Full Stack-ontwikkelaar die ervan houdt ideeën tot leven te brengen door middel van code. Met een talent voor probleemoplossing en een voorliefde voor het creëren van naadloze digitale ervaringen, ben ik altijd op zoek naar de volgende spannende uitdaging in de wereld van webontwikkeling.
sr: Поздрав! Ја сам Саи Крисхна Аннам, страствени Фулл Стацк програмер који успева у оживљавању идеја кроз код. Са вештином за решавање проблема и љубављу према стварању беспрекорних дигиталних искустава, увек сам у потрази за следећим узбудљивим изазовом у свету веб развоја.

# journeyHeading
source: My Journey
nl: Mijn reis
sr: Моје путовање

# journeyContent1
source: My journey into the world of programming began with an unexpected twist. Graduating in Mechanical Engineering, I was far from familiar with coding. However, my strong affinity for technology and my knack for making the most out of a PC ignited a spark within me. It was this very interest that motivated me to embark on a new adventure: learning to code.
nl: Mijn reis in de wereld van programmeren begon met een onverwachte wending. Toen ik afstudeerde in Werktuigbouwkunde, was ik verre van bekend met coderen. Maar mijn sterke affiniteit met technologie en mijn talent om het maximale uit een pc te halen, zorgden ervoor dat er een vonk in mij ontstond. Het was juist deze interesse die mij motiveerde om aan een nieuw avontuur te beginnen: leren coderen.
sr: Моје путовање у свет програмирања почело је неочекиваним обртом. Дипломирао сам на Машинском факултету, био сам далеко од познавања кодирања. Међутим, мој снажан афинитет према технологији и моја способност да максимално искористим рачунар запалили су искру у мени. Управо то интересовање ме је мотивисало да се упустим у нову авантуру: учење кодирања.

# journeyContent2
source: Starting from scratch, I dabbled with HTML and CSS during those initial days. The world of tags and styling felt like a whole new language, but I was determined to decode it. As my proficiency grew, I transitioned to exploring the intricacies of back-end development. Each line of code I typed was a stepping stone towards becoming a versatile Full Stack developer.
nl: Ik begon helemaal opnieuw en heb de eerste dagen met HTML en CSS gewerkt. De wereld van tags en styling voelde als een geheel nieuwe taal, maar ik was vastbesloten om deze te decoderen. Naarmate mijn vaardigheid groeide, ging ik de overstap maken naar het verkennen van de fijne kneepjes van back-endontwikkeling. Elke regel code die ik typte was een opstapje om een ​​veelzijdige Full Stack-ontwikkelaar te worden.
sr: Почевши од нуле, бавио сам се ХТМЛ и ЦСС током тих првих дана. Свет ознака и стилова се осећао као потпуно нови језик, али сам био одлучан да га дешифрујем. Како је моје знање расло, прешао сам на истраживање замршености позадинског развоја. Сваки ред кода који сам откуцао био је одскочна даска ка томе да постанем свестрани програмер за Фулл Стацк.

# journeyContent3
source: Throughout this journey, I've had the privilege of collaborating with exceptionally talented individuals and dynamic teams. These experiences have not only honed my technical skills but have also added layers of depth to my expertise. I've come to realize that coding isn't just about syntax and algorithms; it's about creatively solving problems and building digital experiences that leave a mark.
nl: Tijdens deze reis heb ik het voorrecht gehad om samen te werken met uitzonderlijk getalenteerde individuen en dynamische teams. Deze ervaringen hebben niet alleen mijn technische vaardigheden aangescherpt, maar hebben ook verdieping aan mijn expertise toegevoegd. Ik ben tot het besef gekomen dat coderen niet alleen om syntaxis en algoritmen gaat; het gaat over het creatief oplossen van problemen en het bouwen van digitale ervaringen die een stempel drukken.
sr: Током овог путовања, имао сам привилегију да сарађујем са изузетно талентованим појединцима и динамичним тимовима. Ова искуства нису само усавршила моје техничке вештине, већ су додала и слојеве дубине мојој стручности. Схватио сам да кодирање није само синтакса и алгоритми; ради се о креативном решавању проблема и изградњи дигиталних искустава која остављају траг.

# journeyContent4
source: From a Mechanical Engineering graduate to a Full Stack developer, my journey has been an incredible ride full of challenges, triumphs, and a constant thirst for knowledge. I'm excited to continue this ever-evolving adventure, leveraging my unique background to bring innovative solutions to life.
nl: Van afgestudeerd werktuigbouwkundig ingenieur tot full-stack-ontwikkelaar, mijn reis was een ongelooflijke rit vol uitdagingen, triomfen en een constante honger naar kennis. Ik kijk ernaar uit om dit steeds evoluerende avontuur voort te zetten en mijn unieke achtergrond te benutten om innovatieve oplossingen tot leven te brengen.
sr: Од дипломираног инжењера машинства до фулл стацк програмера, моје путовање је било невероватна вожња пуна изазова, тријумфа и сталне жеђи за знањем. Узбуђен сам што ћу наставити ову авантуру која се непрестано развија, користећи своју јединствену позадину да оживим иновативна решења.

# journeyContent5
source: Remember, it's never about where you start, but the determination and passion that drive you forward. My story is a testament to the fact that unexpected interests can lead to extraordinary paths.
nl: Vergeet niet dat het nooit gaat om waar je begint, maar om de vastberadenheid en passie die je vooruit drijven. Mijn verhaal getuigt van het feit dat onverwachte interesses tot buitengewone paden kunnen leiden.
sr: Запамтите, никада није важно одакле почињете, већ одлучност и страст који вас воде напред. Моја прича је сведочанство чињенице да неочекивана интересовања могу довести до изванредних путева.

# journeyContent6
source: Stay curious, keep coding, and let's shape the future one line of code at a time.
nl: Blijf nieuwsgierig, blijf coderen en laten we de toekomst regel voor code vormgeven.
sr: Останите радознали, наставите са кодирањем и хајде да обликујемо будућност један по један ред кода.

# connectHeading
source: Connect with Me
nl: Maak contact met mij
sr: Повежи се са мном

# connectHeadingContent
source: If you're curious about my work and the projects I've had the pleasure of contributing to, feel free to explore my portfolio and GitHub repositories. You can also connect with me on my social media accounts:
nl: Als je nieuwsgierig bent naar mijn werk en de projecten waaraan ik heb mogen bijdragen, kun je gerust mijn portfolio en GitHub-repository's verkennen. Je kunt ook contact met mij opnemen via mijn sociale media-accounts:
sr: Ако сте радознали о мом раду и пројектима којима сам имао задовољство да допринесем, слободно истражите мој портфолио и ГитХуб репозиторије. Такође се можете повезати са мном на мојим налозима друштвених медија:

# Thanking
source: Thank you for stopping by and getting to know me better. Let's embark on this journey of innovation and growth together!
nl: Bedankt dat je langskwam en mij beter leerde kennen. Laten we samen aan deze reis van innovatie en groei beginnen!
sr: Хвала вам што сте свратили и боље ме упознали. Кренимо на ово путовање иновација и раста заједно!

# stayCuriousMessage
source: Stay curious, stay creative, and keep coding!
nl: Blijf nieuwsgierig, blijf creatief en blijf coderen!
sr: Останите радознали, останите креативни и наставите да кодирате!

source: Warm regards,
nl: Hartelijke groeten,
sr: Топли поздрав,
